app/controllers/assets_controller.rb

SELECT * FROM `assets` WHERE (title LIKE'%%')
---
  def index
    @assets = Asset.search(params[:search], params[:page])

SELECT * FROM `assets` WHERE (`assets`.`id` = 1)
---
  def show
    @asset = Asset.find(params[:id])

SELECT * FROM `assets` WHERE (`assets`.`id` = 1)
---
  def edit
    @asset = Asset.find(params[:id])

INSERT INTO `assets` (`updated_at`, `title`, `file_content_type`, `file_file_name`, `file_updated_at`, `file_file_size`, `created_at`) VALUES('2010-06-28 15:53:19', 'Penguins', 'image/jpeg', 'Penguins.jpg', '2010-06-28 15:53:19', 777835, '2010-06-28 15:53:19')
---
  def create
    @asset = Asset.new(params[:asset])

    respond_to do |format|
      if @asset.save

SELECT * FROM `assets` WHERE (`assets`.`id` = 1)
DELETE FROM `assets` WHERE `id` = 1
---
  def destroy
    @asset = Asset.find(params[:id])
    @asset.destroy